app/Controllers/Api.php

SELECT *
FROM `user`
WHERE `token` = '7e3ffa659b8372b5b368f3750c1b968b'
AND `is_deleted` = 0
 LIMIT 1
SELECT *
FROM `cart`
WHERE `user_id` = '5'
AND `is_deleted` = 0
SELECT *
FROM `product`
WHERE `product_id` = '5'
 LIMIT 1
---
    public function getCart($token){

        try {

            $user_model = new User_model();
            $userdata = $user_model->where([
                'token' => $token,
                'is_deleted' => 0,
            ])->first();

            if(empty($userdata)) {
                throw new \Exception("invalid token");
            }

            $cart_model = new Cart_model();
            $cartList = $cart_model->where([
                'user_id' => $userdata['user_id'],
                'is_deleted' => 0,
            ])->findAll();

            $product_model = new Product_model();

            foreach($cartList as $k=>$v) {

                $productData = $product_model->where([
                    'product_id' => $v['product_id']
                ])->first();