app/Controllers/Backend.php

    public function product_manage(){

        $product_model = new Product_model();
        $productList = $product_model->where(['is_deleted'=>0])->findAll();
---
SELECT *
FROM `product`
WHERE `is_deleted` = 0

    public function user_manage(){

        $user_model = new User_model();
        $userList = $user_model->where(['is_deleted'=>0])->findAll();
---
SELECT *
FROM `user`
WHERE `is_deleted` = 0

    public function user_add($id=""){

        if($id == "") {
            $this->data['mode'] = "Add";
        } else {
            $this->data['mode'] = "Edit";

            $user_model = new User_model();
            $userData = $user_model->find($id);
---
SELECT *
FROM `user`
WHERE `user`.`user_id` = '4'


            } else {

                $user_model->update($id, [
                    'name' => $name,
                    'email' => $email,
                    'password' => $password,
                    'level' => $level,
                    'modified_date' => date("Y-m-d H:i:s")
                ]);
---
UPDATE `user` SET `name` = 'CLCL', `email` = 'CLCL@gmail.com', `password` = 'CL123', `level` = '1', `modified_date` = '2023-09-18 12:19:59'
WHERE `user`.`user_id` IN ('4')