app/Controllers/Frontend.php

    public function home()
    {
        $product_model = new Product_model();
        $productList = $product_model->findAll();
---
SELECT *
FROM `product`