app/Controllers/Shop.php

    public function shop()
    {

        $product_model = new Product_model();
        $productList = $product_model->where(['is_deleted'=>0])->findAll();
---
SELECT *
FROM `product`
WHERE `is_deleted` = 0

    public function cart(){

        //Get userdata by token session
        $user_model = new User_model();
        $userdata = $user_model->where([
                'token' => $this->data['token'],
                'is_deleted' => 0,
        ])->first();

        if(empty($userdata)) {
            throw new \Exception("invalid token");
        }

        //get cart data by user_id
        $cart_model = new Cart_model();
        $cartList = $cart_model->where([
            'user_id' => $userdata['user_id'],
            'is_deleted' => 0,
        ])->findAll();

        $product_model = new Product_model();

        foreach($cartList as $k=>$v) {

            $productData = $product_model->where([
                    'product_id' => $v['product_id']
            ])->first();
---
SELECT *
FROM `user`
WHERE `token` = '514b9dabf8c50510ef50cb413518dc3e'
AND `is_deleted` = 0
 LIMIT 1
SELECT *
FROM `cart`
WHERE `user_id` = '4'
AND `is_deleted` = 0
SELECT *
FROM `product`
WHERE `product_id` = '5'
 LIMIT 1